Table of Contents
 Class BoltGrid
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Data of the bolt grid
public class BoltGrid
Inheritance
object
BoltGrid
Derived
AnchorGrid
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AnchorLen
Anchor lenght
public double AnchorLen { get; set; }
Property Value
double
 AxisX
Bolt grid LCS - Axis X
public Vector3D AxisX { get; set; }
Property Value
Vector3D
 AxisY
Bolt grid LCS - Axis Y
public Vector3D AxisY { get; set; }
Property Value
Vector3D
 AxisZ
Bolt grid LCS - Axis Z
public Vector3D AxisZ { get; set; }
Property Value
Vector3D
 BoltAssemblyName
The description of the bolt assembly
public string BoltAssemblyName { get; set; }
Property Value
string
 BoltAssemblyRef
public string BoltAssemblyRef { get; set; }
Property Value
string
 BoltInteraction
Indicates type of shear transfer
public BoltShearType BoltInteraction { get; set; }
Property Value
BoltShearType
 BoreHole
The BoreHole of bolt
public double BoreHole { get; set; }
Property Value
double
 ConnectedPartIds
Id of the weld
public List<string> ConnectedPartIds { get; set; }
Property Value
List<string>
 ConnectedPlates
Identifiers of the connected plates
public List<int> ConnectedPlates { get; set; }
Property Value
List<int>
 DiagonalHeadDiameter
The Diagonal Head Diameter of bolt
public double DiagonalHeadDiameter { get; set; }
Property Value
double
 Diameter
The diameter of bolt
public double Diameter { get; set; }
Property Value
double
 HeadDiameter
The head diameter of bolt
public double HeadDiameter { get; set; }
Property Value
double
 HeadHeight
The Head Height of bolt
public double HeadHeight { get; set; }
Property Value
double
 HoleDiameter
The diameter of the hole
public double HoleDiameter { get; set; }
Property Value
double
 Id
Unique Id of the bolt grid
public int Id { get; set; }
Property Value
int
 IsAnchor
Is Anchor
public bool IsAnchor { get; set; }
Property Value
bool
 Material
The material of the bolt assembly
public string Material { get; set; }
Property Value
string
 NutThickness
The Nut Thickness of bolt
public double NutThickness { get; set; }
Property Value
double
 Origin
Origin of the bolt grid LCS
public Point3D Origin { get; set; }
Property Value
Point3D
 Positions
Positions of holes in the local coodinate system of the bolt grid
public List<Point3D> Positions { get; set; }
Property Value
List<Point3D>
 ShearInThread
Indicates, whether a shear plane is in the thread of a bolt.
public bool ShearInThread { get; set; }
Property Value
bool
 Standard
The standard of the bolt assembly
public string Standard { get; set; }
Property Value
string
 TensileStressArea
The Tensile Stress Area of bolt
public double TensileStressArea { get; set; }
Property Value
double
 Edit this page